In [1]:
# Import pandas package
import pandas as pd

# Assign data
data = {'Name': ['Honey', 'Dolly', 'TSR',
				'Chinnari'],
		'Age': [20,18,41,50],
		'Gender': ['F','F','M','F'],
		'Marks': [90, 76, 'NaN', 84]}

# Convert into DataFrame
df = pd.DataFrame(data)

# Display data
df

       Name  Age Gender Marks
0     Honey   20      F    90
1     Dolly   18      F    76
2       TSR   41      M   NaN
3  Chinnari   50      F    84

In [2]:
# Compute average
c = avg = 0
for ele in df['Marks']:
	if str(ele).isnumeric():
		c += 1
		avg += ele
avg /= c

# Replace missing values
df = df.replace(to_replace="NaN",
				value=avg)

# Display data
df

       Name  Age Gender      Marks
0     Honey   20      F  90.000000
1     Dolly   18      F  76.000000
2       TSR   41      M  83.333333
3  Chinnari   50      F  84.000000

In [5]:
# import module
import pandas as pd

# creating DataFrame for Student Details
details = pd.DataFrame({
	'ID': [101, 102, 103, 104],
	'NAME': ['Honey','Dolly','TSR','Chinnari'],
	'BRANCH': ['CSE', 'IT', 'MECH', 'ECE']})

# printing details
print(details)

    ID      NAME BRANCH
0  101     Honey    CSE
1  102     Dolly     IT
2  103       TSR   MECH
3  104  Chinnari    ECE

In [6]:
# Import module
import pandas as pd

# Creating Dataframe for Fees_Status
fees_status = pd.DataFrame(
	{'ID': [101, 102, 103, 104],
	'NAME': ['Honey','Dolly','TSR','Chinnari'],
	'PENDING': ['5000', '250', 'NIL',
				'9000']})

# Printing fees_status
print(fees_status)

    ID      NAME PENDING
0  101     Honey    5000
1  102     Dolly     250
2  103       TSR     NIL
3  104  Chinnari    9000

In [9]:
# Import module
import pandas as pd

# Creating Dataframe
details = pd.DataFrame({
	'ID': [101, 102, 103, 104],
	'NAME': ['Honey','Dolly','TSR','Chinnari'],
	'BRANCH': ['CSE', 'IT', 'MECH', 'ECE']})
# Creating Dataframe
fees_status = pd.DataFrame(
	{'ID': [101, 102, 103, 104],
	'PENDING': ['5000', '250', 'NIL',
				'9000']})

# Merging Dataframe
print(pd.merge(details, fees_status, on='ID'))

    ID      NAME BRANCH PENDING
0  101     Honey    CSE    5000
1  102     Dolly     IT     250
2  103       TSR   MECH     NIL
3  104  Chinnari    ECE    9000

In [6]:
# Import module
import pandas as pd

# Creating Data
car_selling_data = {'Brand': ['Maruti', 'Maruti', 'Maruti',
							'Maruti', 'Hyundai', 'Hyundai',
							'Toyota', 'Mahindra', 'Mahindra',
							'Ford', 'Toyota', 'Ford'],
					'Year': [2010, 2011, 2009, 2013,
							2010, 2011, 2011, 2010,
							2013, 2010, 2010, 2011],
					'Sold': [6, 7, 9, 8, 3, 5,
							2, 8, 7, 2, 4, 2]}

# Creating Dataframe of car_selling_data
df = pd.DataFrame(car_selling_data)

# printing Dataframe
print(df)

       Brand  Year  Sold
0     Maruti  2010     6
1     Maruti  2011     7
2     Maruti  2009     9
3     Maruti  2013     8
4    Hyundai  2010     3
5    Hyundai  2011     5
6     Toyota  2011     2
7   Mahindra  2010     8
8   Mahindra  2013     7
9       Ford  2010     2
10    Toyota  2010     4
11      Ford  2011     2

In [7]:
# Import module
import pandas as pd

# Creating Data
car_selling_data = {'Brand': ['Maruti', 'Maruti', 'Maruti',
							'Maruti', 'Hyundai', 'Hyundai',
							'Toyota', 'Mahindra', 'Mahindra',
							'Ford', 'Toyota', 'Ford'],
					'Year': [2010, 2011, 2009, 2013,
							2010, 2011, 2011, 2010,
							2013, 2010, 2010, 2011],
					'Sold': [6, 7, 9, 8, 3, 5,
							2, 8, 7, 2, 4, 2]}

# Creating Dataframe for Provided Data
df = pd.DataFrame(car_selling_data)

# Group the data when year = 2010
grouped = df.groupby('Year')
print(grouped.get_group(2010))

       Brand  Year  Sold
0     Maruti  2010     6
4    Hyundai  2010     3
7   Mahindra  2010     8
9       Ford  2010     2
10    Toyota  2010     4

In [10]:
# Import module
import pandas as pd

# Initializing Data
student_data = {'NAME': ['Honey','Dolly','TSR','Chinnari'],

				'Roll_no': [44,45,46,47],

				'Email': ['honey@gmail.com','dolly@mail.com','tsr@gmail.com','chinnari@gmail.com']}

# Creating Dataframe of Data
df = pd.DataFrame(student_data)

# Printing Dataframe
print(df)

       NAME  Roll_no               Email
0     Honey       44     honey@gmail.com
1     Dolly       45      dolly@mail.com
2       TSR       46       tsr@gmail.com
3  Chinnari       47  chinnari@gmail.com

In [11]:
# import module
import pandas as pd

# initializing Data
student_data = {'NAME': ['Honey','Dolly','TSR','Chinnari'],

				'Roll_no': [44,45,46,47],

				'Email': ['honey@gmail.com','dolly@mail.com','tsr@gmail.com','chinnari@gmail.com']}

# creating dataframe
df = pd.DataFrame(student_data)

# Here df.duplicated() list duplicate Entries in ROllno.
# So that ~(NOT) is placed in order to get non duplicate values.
non_duplicate = df[~df.duplicated('Roll_no')]

# printing non-duplicate values
print(non_duplicate)

       NAME  Roll_no               Email
0     Honey       44     honey@gmail.com
1     Dolly       45      dolly@mail.com
2       TSR       46       tsr@gmail.com
3  Chinnari       47  chinnari@gmail.com